MohamedOsamaAhmed/Fishbowl_ESP_TivaC_IOT/TM4C123GH.h
typedef struct {                                    /*!< SYSCTL Structure                                                      */
   uint32  DID0;                              /*!< Device Identification 0                                               */
   uint32  DID1;                              /*!< Device Identification 1                                               */
   uint32  DC0;                               /*!< Device Capabilities 0                                                 */
   uint32  RESERVED0;
   uint32  DC1;                               /*!< Device Capabilities 1                                                 */
   uint32  DC2;                               /*!< Device Capabilities 2                                                 */
   uint32  DC3;                               /*!< Device Capabilities 3                                                 */
   uint32  DC4;                               /*!< Device Capabilities 4                                                 */
   uint32  DC5;                               /*!< Device Capabilities 5                                                 */
   uint32  DC6;                               /*!< Device Capabilities 6                                                 */
   uint32  DC7;                               /*!< Device Capabilities 7                                                 */
   uint32  DC8;                               /*!< Device Capabilities 8 ADC Channels                                    */
   uint32  PBORCTL;                           /*!< Brown-Out Reset Control                                               */
   uint32  RESERVED1[3];
   uint32  SRCR0;                             /*!< Software Reset Control 0                                              */
   uint32  SRCR1;                             /*!< Software Reset Control 1                                              */
   uint32  SRCR2;                             /*!< Software Reset Control 2                                              */
   uint32  RESERVED2;
   uint32  RIS;                               /*!< Raw Interrupt Status                                                  */
   uint32  IMC;                               /*!< Interrupt Mask Control                                                */
   uint32  MISC;                              /*!< Masked Interrupt Status and Clear                                     */
   uint32  RESC;                              /*!< Reset Cause                                                           */
   uint32  RCC;                               /*!< Run-Mode Clock Configuration                                          */
   uint32  RESERVED3[2];
   uint32  GPIOHBCTL;                         /*!< GPIO High-Performance Bus Control                                     */
   uint32  RCC2;                              /*!< Run-Mode Clock Configuration 2                                        */
   uint32  RESERVED4[2];
   uint32  MOSCCTL;                           /*!< Main Oscillator Control                                               */
   uint32  RESERVED5[32];
   uint32  RCGC0;                             /*!< Run Mode Clock Gating Control Register 0                              */
   uint32  RCGC1;                             /*!< Run Mode Clock Gating Control Register 1                              */
   uint32  RCGC2;                             /*!< Run Mode Clock Gating Control Register 2                              */
   uint32  RESERVED6;
   uint32  SCGC0;                             /*!< Sleep Mode Clock Gating Control Register 0                            */
   uint32  SCGC1;                             /*!< Sleep Mode Clock Gating Control Register 1                            */
   uint32  SCGC2;                             /*!< Sleep Mode Clock Gating Control Register 2                            */
   uint32  RESERVED7;
   uint32  DCGC0;                             /*!< Deep Sleep Mode Clock Gating Control Register 0                       */
   uint32  DCGC1;                             /*!< Deep-Sleep Mode Clock Gating Control Register 1                       */
   uint32  DCGC2;                             /*!< Deep Sleep Mode Clock Gating Control Register 2                       */
   uint32  RESERVED8[6];
   uint32  DSLPCLKCFG;                        /*!< Deep Sleep Clock Configuration                                        */
   uint32  RESERVED9;
   uint32  SYSPROP;                           /*!< System Properties                                                     */
   uint32  PIOSCCAL;                          /*!< Precision Internal Oscillator Calibration                             */
   uint32  PIOSCSTAT;                         /*!< Precision Internal Oscillator Statistics                              */
   uint32  RESERVED10[2];
   uint32  PLLFREQ0;                          /*!< PLL Frequency 0                                                       */
   uint32  PLLFREQ1;                          /*!< PLL Frequency 1                                                       */
   uint32  PLLSTAT;                           /*!< PLL Status                                                            */
   uint32  RESERVED11[9];
   uint32  DC9;                               /*!< Device Capabilities 9 ADC Digital Comparators                         */
   uint32  RESERVED12[3];
   uint32  NVMSTAT;                           /*!< Non-Volatile Memory Information                                       */
   uint32  RESERVED13[87];
   uint32  PPWD;                              /*!< Watchdog Timer Peripheral Present                                     */
   uint32  PPTIMER;                           /*!< Timer Peripheral Present                                              */
   uint32  PPGPIO;                            /*!< General-Purpose Input/Output Peripheral Present                       */
   uint32  PPDMA;                             /*!< Micro Direct Memory Access Peripheral Present                         */
   uint32  RESERVED14;
   uint32  PPHIB;                             /*!< Hibernation Peripheral Present                                        */
   uint32  PPUART;                            /*!< Universal Asynchronous Receiver/Transmitter Peripheral Present        */
   uint32  PPSSI;                             /*!< Synchronous Serial Interface Peripheral Present                       */
   uint32  PPI2C;                             /*!< Inter-Integrated Circuit Peripheral Present                           */
   uint32  RESERVED15;
   uint32  PPUSB;                             /*!< Universal Serial Bus Peripheral Present                               */
   uint32  RESERVED16[2];
   uint32  PPCAN;                             /*!< Controller Area Network Peripheral Present                            */
   uint32  PPADC;                             /*!< Analog-to-Digital Converter Peripheral Present                        */
   uint32  PPACMP;                            /*!< Analog Comparator Peripheral Present                                  */
   uint32  PPPWM;                             /*!< Pulse Width Modulator Peripheral Present                              */
   uint32  PPQEI;                             /*!< Quadrature Encoder Interface Peripheral Present                       */
   uint32  RESERVED17[4];
   uint32  PPEEPROM;                          /*!< EEPROM Peripheral Present                                             */
   uint32  PPWTIMER;                          /*!< Wide Timer Peripheral Present                                         */
   uint32  RESERVED18[104];
   uint32  SRWD;                              /*!< Watchdog Timer Software Reset                                         */
   uint32  SRTIMER;                           /*!< Timer Software Reset                                                  */
   uint32  SRGPIO;                            /*!< General-Purpose Input/Output Software Reset                           */
   uint32  SRDMA;                             /*!< Micro Direct Memory Access Software Reset                             */
   uint32  RESERVED19;
   uint32  SRHIB;                             /*!< Hibernation Software Reset                                            */
   uint32  SRUART;                            /*!< Universal Asynchronous Receiver/Transmitter Software Reset            */
   uint32  SRSSI;                             /*!< Synchronous Serial Interface Software Reset                           */
   uint32  SRI2C;                             /*!< Inter-Integrated Circuit Software Reset                               */
   uint32  RESERVED20;
   uint32  SRUSB;                             /*!< Universal Serial Bus Software Reset                                   */
   uint32  RESERVED21[2];
   uint32  SRCAN;                             /*!< Controller Area Network Software Reset                                */
   uint32  SRADC;                             /*!< Analog-to-Digital Converter Software Reset                            */
   uint32  SRACMP;                            /*!< Analog Comparator Software Reset                                      */
   uint32  SRPWM;                             /*!< Pulse Width Modulator Software Reset                                  */
   uint32  SRQEI;                             /*!< Quadrature Encoder Interface Software Reset                           */
   uint32  RESERVED22[4];
   uint32  SREEPROM;                          /*!< EEPROM Software Reset                                                 */
   uint32  SRWTIMER;                          /*!< Wide Timer Software Reset                                             */
   uint32  RESERVED23[40];
   uint32  RCGCWD;                            /*!< Watchdog Timer Run Mode Clock Gating Control                          */
   uint32  RCGCTIMER;                         /*!< Timer Run Mode Clock Gating Control                                   */
   uint32  RCGCGPIO;                          /*!< General-Purpose Input/Output Run Mode Clock Gating Control            */
   uint32  RCGCDMA;                           /*!< Micro Direct Memory Access Run Mode Clock Gating Control              */
   uint32  RESERVED24;
   uint32  RCGCHIB;                           /*!< Hibernation Run Mode Clock Gating Control                             */
   uint32  RCGCUART;                          /*!< Universal Asynchronous Receiver/Transmitter Run Mode Clock Gating                                                 Control                                                               */
   uint32  RCGCSSI;                           /*!< Synchronous Serial Interface Run Mode Clock Gating Control            */
   uint32  RCGCI2C;                           /*!< Inter-Integrated Circuit Run Mode Clock Gating Control                */
   uint32  RESERVED25;
   uint32  RCGCUSB;                           /*!< Universal Serial Bus Run Mode Clock Gating Control                    */
   uint32  RESERVED26[2];
   uint32  RCGCCAN;                           /*!< Controller Area Network Run Mode Clock Gating Control                 */
   uint32  RCGCADC;                           /*!< Analog-to-Digital Converter Run Mode Clock Gating Control             */
   uint32  RCGCACMP;                          /*!< Analog Comparator Run Mode Clock Gating Control                       */
   uint32  RCGCPWM;                           /*!< Pulse Width Modulator Run Mode Clock Gating Control                   */
   uint32  RCGCQEI;                           /*!< Quadrature Encoder Interface Run Mode Clock Gating Control            */
   uint32  RESERVED27[4];
   uint32  RCGCEEPROM;                        /*!< EEPROM Run Mode Clock Gating Control                                  */
   uint32  RCGCWTIMER;                        /*!< Wide Timer Run Mode Clock Gating Control                              */
   uint32  RESERVED28[40];
   uint32  SCGCWD;                            /*!< Watchdog Timer Sleep Mode Clock Gating Control                        */
   uint32  SCGCTIMER;                         /*!< Timer Sleep Mode Clock Gating Control                                 */
   uint32  SCGCGPIO;                          /*!< General-Purpose Input/Output Sleep Mode Clock Gating Control          */
   uint32  SCGCDMA;                           /*!< Micro Direct Memory Access Sleep Mode Clock Gating Control            */
   uint32  RESERVED29;
   uint32  SCGCHIB;                           /*!< Hibernation Sleep Mode Clock Gating Control                           */
   uint32  SCGCUART;                          /*!< Universal Asynchronous Receiver/Transmitter Sleep Mode Clock                                                   Gating Control                                                        */
   uint32  SCGCSSI;                           /*!< Synchronous Serial Interface Sleep Mode Clock Gating Control          */
   uint32  SCGCI2C;                           /*!< Inter-Integrated Circuit Sleep Mode Clock Gating Control              */
   uint32  RESERVED30;
   uint32  SCGCUSB;                           /*!< Universal Serial Bus Sleep Mode Clock Gating Control                  */
   uint32  RESERVED31[2];
   uint32  SCGCCAN;                           /*!< Controller Area Network Sleep Mode Clock Gating Control               */
   uint32  SCGCADC;                           /*!< Analog-to-Digital Converter Sleep Mode Clock Gating Control           */
   uint32  SCGCACMP;                          /*!< Analog Comparator Sleep Mode Clock Gating Control                     */
   uint32  SCGCPWM;                           /*!< Pulse Width Modulator Sleep Mode Clock Gating Control                 */
   uint32  SCGCQEI;                           /*!< Quadrature Encoder Interface Sleep Mode Clock Gating Control          */
   uint32  RESERVED32[4];
   uint32  SCGCEEPROM;                        /*!< EEPROM Sleep Mode Clock Gating Control                                */
   uint32  SCGCWTIMER;                        /*!< Wide Timer Sleep Mode Clock Gating Control                            */
   uint32  RESERVED33[40];
   uint32  DCGCWD;                            /*!< Watchdog Timer Deep-Sleep Mode Clock Gating Control                   */
   uint32  DCGCTIMER;                         /*!< Timer Deep-Sleep Mode Clock Gating Control                            */
   uint32  DCGCGPIO;                          /*!< General-Purpose Input/Output Deep-Sleep Mode Clock Gating Control     */
   uint32  DCGCDMA;                           /*!< Micro Direct Memory Access Deep-Sleep Mode Clock Gating Control       */
   uint32  RESERVED34;
   uint32  DCGCHIB;                           /*!< Hibernation Deep-Sleep Mode Clock Gating Control                      */
   uint32  DCGCUART;                          /*!< Universal Asynchronous Receiver/Transmitter Deep-Sleep Mode                                                 Clock Gating Control                                                  */
   uint32  DCGCSSI;                           /*!< Synchronous Serial Interface Deep-Sleep Mode Clock Gating Control     */
   uint32  DCGCI2C;                           /*!< Inter-Integrated Circuit Deep-Sleep Mode Clock Gating Control         */
   uint32  RESERVED35;
   uint32  DCGCUSB;                           /*!< Universal Serial Bus Deep-Sleep Mode Clock Gating Control             */
   uint32  RESERVED36[2];
   uint32  DCGCCAN;                           /*!< Controller Area Network Deep-Sleep Mode Clock Gating Control          */
   uint32  DCGCADC;                           /*!< Analog-to-Digital Converter Deep-Sleep Mode Clock Gating Control      */
   uint32  DCGCACMP;                          /*!< Analog Comparator Deep-Sleep Mode Clock Gating Control                */
   uint32  DCGCPWM;                           /*!< Pulse Width Modulator Deep-Sleep Mode Clock Gating Control            */
   uint32  DCGCQEI;                           /*!< Quadrature Encoder Interface Deep-Sleep Mode Clock Gating Control     */
   uint32  RESERVED37[4];
   uint32  DCGCEEPROM;                        /*!< EEPROM Deep-Sleep Mode Clock Gating Control                           */
   uint32  DCGCWTIMER;                        /*!< Wide Timer Deep-Sleep Mode Clock Gating Control                       */
   uint32  RESERVED38[104];
   uint32  PRWD;                              /*!< Watchdog Timer Peripheral Ready                                       */
   uint32  PRTIMER;                           /*!< Timer Peripheral Ready                                                */
   uint32  PRGPIO;                            /*!< General-Purpose Input/Output Peripheral Ready                         */
   uint32  PRDMA;                             /*!< Micro Direct Memory Access Peripheral Ready                           */
   uint32  RESERVED39;
   uint32  PRHIB;                             /*!< Hibernation Peripheral Ready                                          */
   uint32  PRUART;                            /*!< Universal Asynchronous Receiver/Transmitter Peripheral Ready          */
   uint32  PRSSI;                             /*!< Synchronous Serial Interface Peripheral Ready                         */
   uint32  PRI2C;                             /*!< Inter-Integrated Circuit Peripheral Ready                             */
   uint32  RESERVED40;
   uint32  PRUSB;                             /*!< Universal Serial Bus Peripheral Ready                                 */
   uint32  RESERVED41[2];
   uint32  PRCAN;                             /*!< Controller Area Network Peripheral Ready                              */
   uint32  PRADC;                             /*!< Analog-to-Digital Converter Peripheral Ready                          */
   uint32  PRACMP;                            /*!< Analog Comparator Peripheral Ready                                    */
   uint32  PRPWM;                             /*!< Pulse Width Modulator Peripheral Ready                                */
   uint32  PRQEI;                             /*!< Quadrature Encoder Interface Peripheral Ready                         */
   uint32  RESERVED42[4];
   uint32  PREEPROM;                          /*!< EEPROM Peripheral Ready                                               */
   uint32  PRWTIMER;                          /*!< Wide Timer Peripheral Ready                                           */
} SYSCTL_Type;

