MohamedOsamaAhmed/Fishbowl_ESP_TivaC_IOT/TM4C123GH.h
typedef struct {                                    /*!< ADC0 Structure                                                        */
   uint32  ACTSS;                             /*!< ADC Active Sample Sequencer                                           */
   uint32  RIS;                               /*!< ADC Raw Interrupt Status                                              */
   uint32  IM;                                /*!< ADC Interrupt Mask                                                    */
   uint32  ISC;                               /*!< ADC Interrupt Status and Clear                                        */
   uint32  OSTAT;                             /*!< ADC Overflow Status                                                   */
   uint32  EMUX;                              /*!< ADC Event Multiplexer Select                                          */
   uint32  USTAT;                             /*!< ADC Underflow Status                                                  */
   uint32  TSSEL;                             /*!< ADC Trigger Source Select                                             */
   uint32  SSPRI;                             /*!< ADC Sample Sequencer Priority                                         */
   uint32  SPC;                               /*!< ADC Sample Phase Control                                              */
   uint32  PSSI;                              /*!< ADC Processor Sample Sequence Initiate                                */
   uint32  RESERVED0;
   uint32  SAC;                               /*!< ADC Sample Averaging Control                                          */
   uint32  DCISC;                             /*!< ADC Digital Comparator Interrupt Status and Clear                     */
   uint32  CTL;                               /*!< ADC Control                                                           */
   uint32  RESERVED1;
   uint32  SSMUX0;                            /*!< ADC Sample Sequence Input Multiplexer Select 0                        */
   uint32  SSCTL0;                            /*!< ADC Sample Sequence Control 0                                         */
   uint32  SSFIFO0;                           /*!< ADC Sample Sequence Result FIFO 0                                     */
   uint32  SSFSTAT0;                          /*!< ADC Sample Sequence FIFO 0 Status                                     */
   uint32  SSOP0;                             /*!< ADC Sample Sequence 0 Operation                                       */
   uint32  SSDC0;                             /*!< ADC Sample Sequence 0 Digital Comparator Select                       */
   uint32  RESERVED2[2];
   uint32  SSMUX1;                            /*!< ADC Sample Sequence Input Multiplexer Select 1                        */
   uint32  SSCTL1;                            /*!< ADC Sample Sequence Control 1                                         */
   uint32  SSFIFO1;                           /*!< ADC Sample Sequence Result FIFO 1                                     */
   uint32  SSFSTAT1;                          /*!< ADC Sample Sequence FIFO 1 Status                                     */
   uint32  SSOP1;                             /*!< ADC Sample Sequence 1 Operation                                       */
   uint32  SSDC1;                             /*!< ADC Sample Sequence 1 Digital Comparator Select                       */
   uint32  RESERVED3[2];
   uint32  SSMUX2;                            /*!< ADC Sample Sequence Input Multiplexer Select 2                        */
   uint32  SSCTL2;                            /*!< ADC Sample Sequence Control 2                                         */
   uint32  SSFIFO2;                           /*!< ADC Sample Sequence Result FIFO 2                                     */
   uint32  SSFSTAT2;                          /*!< ADC Sample Sequence FIFO 2 Status                                     */
   uint32  SSOP2;                             /*!< ADC Sample Sequence 2 Operation                                       */
   uint32  SSDC2;                             /*!< ADC Sample Sequence 2 Digital Comparator Select                       */
   uint32  RESERVED4[2];
   uint32  SSMUX3;                            /*!< ADC Sample Sequence Input Multiplexer Select 3                        */
   uint32  SSCTL3;                            /*!< ADC Sample Sequence Control 3                                         */
   uint32  SSFIFO3;                           /*!< ADC Sample Sequence Result FIFO 3                                     */
   uint32  SSFSTAT3;                          /*!< ADC Sample Sequence FIFO 3 Status                                     */
   uint32  SSOP3;                             /*!< ADC Sample Sequence 3 Operation                                       */
   uint32  SSDC3;                             /*!< ADC Sample Sequence 3 Digital Comparator Select                       */
   uint32  RESERVED5[786];
   uint32  DCRIC;                             /*!< ADC Digital Comparator Reset Initial Conditions                       */
   uint32  RESERVED6[63];
   uint32  DCCTL0;                            /*!< ADC Digital Comparator Control 0                                      */
   uint32  DCCTL1;                            /*!< ADC Digital Comparator Control 1                                      */
   uint32  DCCTL2;                            /*!< ADC Digital Comparator Control 2                                      */
   uint32  DCCTL3;                            /*!< ADC Digital Comparator Control 3                                      */
   uint32  DCCTL4;                            /*!< ADC Digital Comparator Control 4                                      */
   uint32  DCCTL5;                            /*!< ADC Digital Comparator Control 5                                      */
   uint32  DCCTL6;                            /*!< ADC Digital Comparator Control 6                                      */
   uint32  DCCTL7;                            /*!< ADC Digital Comparator Control 7                                      */
   uint32  RESERVED7[8];
   uint32  DCCMP0;                            /*!< ADC Digital Comparator Range 0                                        */
   uint32  DCCMP1;                            /*!< ADC Digital Comparator Range 1                                        */
   uint32  DCCMP2;                            /*!< ADC Digital Comparator Range 2                                        */
   uint32  DCCMP3;                            /*!< ADC Digital Comparator Range 3                                        */
   uint32  DCCMP4;                            /*!< ADC Digital Comparator Range 4                                        */
   uint32  DCCMP5;                            /*!< ADC Digital Comparator Range 5                                        */
   uint32  DCCMP6;                            /*!< ADC Digital Comparator Range 6                                        */
   uint32  DCCMP7;                            /*!< ADC Digital Comparator Range 7                                        */
   uint32  RESERVED8[88];
   uint32  PP;                                /*!< ADC Peripheral Properties                                             */
   uint32  PC;                                /*!< ADC Peripheral Configuration                                          */
   uint32  CC;                                /*!< ADC Clock Configuration                                               */
} ADC0_Type;



/*****************************************************************************
Systick Timer Registers
*****************************************************************************/
#define SYSTICK_CTRL_REG          (*((volatile unsigned long *)0xE000E010))
#define SYSTICK_RELOAD_REG        (*((volatile unsigned long *)0xE000E014))
#define SYSTICK_CURRENT_REG       (*((volatile unsigned long *)0xE000E018))
